/* ----------------------------------------
 * 本函数用于从字符串指定首尾位置截取内容
 * ret:		用于存放截取的结果
 * buf:		用于截取的字符串
 * x:		起始位置
 * y:		结束位置
 * ----------------------------------------
 * 作者Gean:
 * 允许所有人使用，使用时请保留此内容.
 * ----------------------------------------
 * 日志:
 * 2020-04-13:  初次上传
 *              Gean<qingean@outlook.com>
 * 
 * 
 * ---------------------------------------
 */

#include<string.h>

void qsplits(char *ret,char *buf,int x,int y){
	int i;
	int j=0;
	for(i=x-1;i<y;i++){
		ret[j]=buf[i];
		j=j+1;
	}
	ret[j]='\0';
}
